//函数的递归,函数自己调用自己

//1. 接受一个整型值(无符号)，按照顺序打印它的每一位，比如输入1234，打印1 2 3 4
#include <stdio.h>
void print(unsigned int m)
{
    if (m>9)
    {
        print(m/10);
    }
    printf("%d ",m%10);
}

#include <stdio.h>
int main()
{
    unsigned int a=0;//没有负数
    int th=0,hun=0,ten=0,one=0;
    printf("输入值:\n");
    scanf("%u",&a);//%u打印无符号的整数（没有负数）
    print(a);

    return 0;
}








/*

//先看思路，在正常情况下怎样得到这样的数字，拿1234举例子
//首先个位数很容易得到

//1234%10----------->4
//1234/10----------->123
//123%10------------>3
//123/10------------>12
//12%10------------->2
//12/10------------->1
//1%10-------------->1?

*/



























