//






#include <stdio.h>
//算术操作符与移位操作符
//算术操作符
//整形的
//移位操作符
//移位操作符－－－－移动二进制位
//<<左移操作符
//>>右移操作符
//整数的二进制表示有三种
//原码补码反码 
//正整数的原码补码反码都相同
//比如：
//7 
//0000 0000 0000 0000 0000 0000 0000 0111-----原码
//0000 0000 0000 0000 0000 0000 0000 0111-----反码
//0000 0000 0000 0000 0000 0000 0000 0111-----补码
//-7
//1000 0000 0000 0000 0000 0000 0000 0111-----原码
//1111 1111 1111 1111 1111 1111 1111 1000-----反码
//原码的符号位不变其他按位取反
//1111 1111 1111 1111 1111 1111 1111 1001-----补码
//反码加1就是补码


//整数在内存中中存储的是补码


int main()
{
    //左移操作符
    int a=-7;//0000 0000 0000 0000 0000 0000 0000 0111
    int b=a<<1;//左移 移动二进制位
    //对于整数的补码进行左移(左移的对象是整数)
    //左边对齐右边补0
    //0 //000 0000 0000 0000 0000 0000 0000 0111 0
    //a的值不变
    printf("%d,%d\n",a,b);

    //右移操作符
    int m=7;
    int n=m>>1;
    printf("%d,%d\n",a,n);
    //算术移位：右边丢弃，左边补原符号位
    //0000 0000 0000 0000 0000 0000 0000 0111----->7
    //0 0000 0000 0000 0000 0000 0000 0000 011----->3
    //0000 0000 0000 0000 0000 0000 0000 0011----->3
    //                                
  

    //移位操作符后必须是正整数
    return 0;
}
























